Функционал: Страница сериала
  Для того, чтобы выбрать серию
  Мне как пользователю
  Нужна страница с "духом" сериала и кратким его описанием

  Сценарий: Выбор серии
    Допустим есть сериал "Доктор Хауз" из 7 сезонов
    Если я выбрал сериал "Доктор Хауз"
    Когда я попадаю на страницу сериала
    То я должен увидеть описание сериала
    И я должен увидеть постер сериала
    И я должен увидеть названия серий, отсортированных по сезонам
    И я должен перейти на страницу видеоплеера сериала по клику на серии
